<?php

namespace Database\Seeders;

use App\Models\Product;
use App\Models\ProductImage;
use Illuminate\Database\Seeder;

class ProductSeeder extends Seeder
{
    public function run()
    {
        Product::create([
            'category_id' => 4,
            'brand_id' => null,
            'title' => 'مقاومت 220 اهم 0.25w بسته 50 تایی',
            'code' => 122,
            'price' => 5200,
            'inventory' => 10,
            'discount_percent' => 0,
            'special_offer' => false,
            'discount_rules' => json_encode([
                '1' => '0',
                '5' => '3',
            ]),
            'description' => 'این مقاومت یک قطعه الکترونیکی است که می‌تواند در مدارها و کاربردهای مختلف استفاده شود.
<b>معرفی مقاومت470k اهم 0.25w:</b>

<ul>
<li>مقدار مقاومت: مقدار مقاومت این قطعه 470 کیلواهم است. این مقدار مقاومت نشان‌دهنده مقاومت بسیار بزرگی است که جریان الکتریکی را مقاومت می‌کند.</li>
<li>    تحمل توان: این مقاومت تا توان الکتریکی حداکثر 0.25 وات را تحمل می‌کند. بنابراین، در صورتی که توان مصرفی مدار 0.25 وات را تجاوز کند، ممکن است مقاومت آسیب ببیند و کارکرد آن تحت تأثیر قرار بگیرد.</li>
<li>    دقت تحمل: مقاومت‌ها معمولاً دارای دقت تحملی هستند که انحراف ممکن از مقدار مقاومت اصلی را نشان می‌دهد. دقت تحمل این مقاومت ممکن است در حدود 5٪ یا 10٪ باشد.</li>
<li>    محدوده دمای کاری: این مقاومت معمولاً در محدوده دمایی مشخص کار می‌کند. محدوده دمایی معمولاً بین -55 درجه سانتیگراد تا +155 درجه سانتیگراد است.</li>
<li>    محدوده ولتاژ: این مقاومت برای کاربردهایی با ولتاژ معمولی تا حداکثر تحمل ولتاژ طراحی شده است. محدوده ولتاژ کاری به طور دقیق در دیتاشیت (شیت فنی) مقاومت مشخص می‌شود.</li>
</ul>
',
            'technical_description' => '

<h2>مشخصات فنی مقاومت470k اهم 0.25w:</h2>

مقدار مقاومت: 470 کیلواهم (470,000 اهم)این مقدار نشان دهنده مقاومت الکتریکی قطعه است و در واحد اهم (Ω) اندازه‌گیری می‌شود.
<br>
تحمل توان: 0.25 واتاین مقدار نشان دهنده حداکثر توان الکتریکی است که مقاومت می‌تواند تحمل کند. در این حالت، توان مصرفی نباید بیش از 0.25 وات باشد، زیرا ممکن است باعث آسیب رساندن به مقاومت شود.
<br>
دقت تحمل: معمولاً دقت تحمل مقاومت‌ها در صورتی که ذکر نشده باشد، در حدود 5٪ تا 10٪ است. این به معنای این است که مقاومت می‌تواند تا 10٪ از مقدار اعلام شده انحراف داشته باشد.
<br>
محدوده دمای کاری: معمولاً این مقاومت در محدوده دمایی مشخص کار می‌کند، معمولاً بین -55 درجه سانتیگراد تا +155 درجه سانتیگراد.
<br>
محدوده ولتاژ: محدوده ولتاژ کاری برای این مقاومت در دیتاشیت (شیت فنی) مشخص شده است و ممکن است بسته به تولیدکننده و مدل مختلف مقاومت متغیر باشد.
',
        ]);

        Product::create([
            'category_id' => 4,
            'brand_id' => null,
            'title' => 'مقاومت 220 اهم 0.25w بسته 100 تایی',
            'code' => 123,
            'price' => 10000,
            'inventory' => 4,
            'discount_percent' => 0,
            'special_offer' => false,
            'discount_rules' => json_encode([
                '1' => '0',
                '5' => '3',
                '10' => '5',
            ]),
            'description' => 'این مقاومت یک قطعه الکترونیکی است که می‌تواند در مدارها و کاربردهای مختلف استفاده شود.
<b>معرفی مقاومت470k اهم 0.25w:</b>

<ul>
<li>مقدار مقاومت: مقدار مقاومت این قطعه 470 کیلواهم است. این مقدار مقاومت نشان‌دهنده مقاومت بسیار بزرگی است که جریان الکتریکی را مقاومت می‌کند.</li>
<li>    تحمل توان: این مقاومت تا توان الکتریکی حداکثر 0.25 وات را تحمل می‌کند. بنابراین، در صورتی که توان مصرفی مدار 0.25 وات را تجاوز کند، ممکن است مقاومت آسیب ببیند و کارکرد آن تحت تأثیر قرار بگیرد.</li>
<li>    دقت تحمل: مقاومت‌ها معمولاً دارای دقت تحملی هستند که انحراف ممکن از مقدار مقاومت اصلی را نشان می‌دهد. دقت تحمل این مقاومت ممکن است در حدود 5٪ یا 10٪ باشد.</li>
<li>    محدوده دمای کاری: این مقاومت معمولاً در محدوده دمایی مشخص کار می‌کند. محدوده دمایی معمولاً بین -55 درجه سانتیگراد تا +155 درجه سانتیگراد است.</li>
<li>    محدوده ولتاژ: این مقاومت برای کاربردهایی با ولتاژ معمولی تا حداکثر تحمل ولتاژ طراحی شده است. محدوده ولتاژ کاری به طور دقیق در دیتاشیت (شیت فنی) مقاومت مشخص می‌شود.</li>
</ul>
',
            'technical_description' => '

<h2>مشخصات فنی مقاومت470k اهم 0.25w:</h2>

مقدار مقاومت: 470 کیلواهم (470,000 اهم)این مقدار نشان دهنده مقاومت الکتریکی قطعه است و در واحد اهم (Ω) اندازه‌گیری می‌شود.
<br>
تحمل توان: 0.25 واتاین مقدار نشان دهنده حداکثر توان الکتریکی است که مقاومت می‌تواند تحمل کند. در این حالت، توان مصرفی نباید بیش از 0.25 وات باشد، زیرا ممکن است باعث آسیب رساندن به مقاومت شود.
<br>
دقت تحمل: معمولاً دقت تحمل مقاومت‌ها در صورتی که ذکر نشده باشد، در حدود 5٪ تا 10٪ است. این به معنای این است که مقاومت می‌تواند تا 10٪ از مقدار اعلام شده انحراف داشته باشد.
<br>
محدوده دمای کاری: معمولاً این مقاومت در محدوده دمایی مشخص کار می‌کند، معمولاً بین -55 درجه سانتیگراد تا +155 درجه سانتیگراد.
<br>
محدوده ولتاژ: محدوده ولتاژ کاری برای این مقاومت در دیتاشیت (شیت فنی) مشخص شده است و ممکن است بسته به تولیدکننده و مدل مختلف مقاومت متغیر باشد.
',
        ]);

        Product::create([
            'category_id' => 3,
            'brand_id' => null,
            'title' => 'کیس رزبری پای4 با قابلیت نصب فن',
            'code' => 2943,
            'price' => 55000,
            'inventory' => 21,
            'discount_percent' => 0,
            'special_offer' => false,
            'discount_rules' => json_encode([
                '1' => '0',
                '2' => '3',
                '5' => '5',
                '10' => '10',
            ]),
            'description' => '
<p>قاب Raspberry Pi 4 یک محفظه محافظ است که برای جا دادن و محافظت از برد Raspberry Pi 4 طراحی شده است.</p>
<h2>کیس Raspberry Pi 4 چیست:</h2>
<p>این کیس از پلاستیک یا فلز ساخته شده و حفاظت فیزیکی و محیطی برد Raspberry Pi 4 را فراهم می کند. این کیس دارای دهانه ها یا برش هایی برای پورت ها و کانکتورهای مختلف روی برد Raspberry Pi است که امکان دسترسی آسان به کابل ها و وسایل جانبی را برای اتصال فراهم می کند. این کیس همچنین تهویه مناسبی را برای جلوگیری از داغ شدن بیش از حد Raspberry Pi 4 در حین استفاده فراهم می کند. برخی از کیس های Raspberry Pi 4 دارای ویژگی های اضافی مانند فن های داخلی، هیت سینک ها و براکت های نصب هستند. قاب‌های Raspberry Pi 4 در طرح‌ها و رنگ‌های مختلف موجود هستند که آن‌ها را برای موارد استفاده مختلف و ترجیحات شخصی مناسب می‌سازد.</p>
<h2>کاربردهای کیس Raspberry Pi 4:</h2>
<p>کیس Raspberry Pi 4 کاربردهای متعددی دارد، از جمله:</p>
<ul>
<li><strong>محافظت:</strong> وظیفه اصلی قاب Raspberry Pi 4 محافظت از برد در برابر آسیب فیزیکی و عوامل محیطی مانند گرد و غبار، رطوبت و الکتریسیته ساکن است.</li>
<li><strong>نصب:</strong> این کیس امکان نصب آسان برد Raspberry Pi را در یک مکان ثابت فراهم می کند.</li>
<li><strong>زیبایی شناسی:</strong> قاب ظاهر تخته Raspberry Pi را بهبود می بخشد و می تواند دکوراسیون اتاق یا وسیله مورد استفاده را تکمیل کند.</li>
<li><strong>اتلاف گرما:</strong> برخی از کیس های Raspberry Pi 4 شامل فن یا هیت سینک برای اطمینان از اتلاف گرما هستند که برای جلوگیری از داغ شدن بیش از حد برد ضروری است.</li>
<li><strong>دسترسی:</strong> این کیس دسترسی آسان به پورت ها و کانکتورهای برد Raspberry Pi را فراهم می کند و اتصال لوازم جانبی و کابل ها را آسان می کند.</li>
<li><strong>حمل و نقل و ذخیره سازی:</strong> قاب Raspberry Pi 4 را می توان برای حمل یا نگهداری ایمن برد مورد استفاده قرار داد و آن را برای پروژه های قابل حمل یا برای نگهداری برد در صورت عدم استفاده ایده آل می کند.</li>
</ul>
<p>به طور کلی، کیس های Raspberry Pi 4 همه کاره هستند و در موارد استفاده مختلف از محافظت، زیبایی شناسی، دسترسی، اتلاف گرما، حمل و نقل و ذخیره سازی کاربرد دارند و آنها را به یک لوازم جانبی ضروری برای کاربران Raspberry Pi تبدیل می کند.</p>
<h2>مزایای قاب Raspberry Pi 4:</h2>
<p>مزایای قاب Raspberry Pi 4 عبارتند از:</p>
<ul>
<li><strong>محافظت:</strong> این کیس از آسیب فیزیکی و عوامل محیطی مانند گرد و غبار، رطوبت و الکتریسیته ساکن محافظت می کند.</li>
<li><strong>اتلاف گرما:</strong> برخی از کیس های Raspberry Pi 4 دارای فن یا هیت سینک هستند که باعث اتلاف گرمای مناسب می شوند و از داغ شدن بیش از حد برد جلوگیری می کنند که می تواند طول عمر برد را افزایش دهد.</li>
<li><strong>دسترسی:</strong> این کیس دسترسی آسان به پورت ها و کانکتورهای برد Raspberry Pi را فراهم می کند و اتصال لوازم جانبی و کابل ها را آسان می کند.</li>
<li><strong>زیبایی:</strong> قاب‌های Raspberry Pi 4 در طرح‌ها و رنگ‌های متنوعی عرضه می‌شوند که می‌تواند ظاهر و زیبایی برد Raspberry Pi را در عین تکمیل دکور محیط اطراف بهبود بخشد.</li>
<li><strong>نصب:</strong> این کیس امکان نصب آسان برد Raspberry Pi را در یک مکان ثابت می دهد که می تواند برای پروژه های مختلف مفید باشد.</li>
<li><strong>مقرون به صرفه:</strong> قاب های Raspberry Pi 4 مقرون به صرفه هستند و آنها را به سرمایه گذاری عالی برای محافظت و افزایش عملکرد برد تبدیل می کند.</li>
</ul>
<p>به طور خلاصه، قاب‌های Raspberry Pi 4 از آسیب‌های فیزیکی محافظت می‌کنند، ظاهر برد را بهبود می‌بخشند و دسترسی آسان به پورت‌ها و کانکتورها را فراهم می‌کنند. آنها همچنین مقرون به صرفه هستند و ممکن است شامل ویژگی های اضافی مانند اتلاف گرما و گزینه های نصب باشند.</p>
<h2>معایب کیس Raspberry Pi 4:</h2>
<p>چند معایب در مورد Raspberry Pi 4 وجود دارد که باید در نظر گرفته شود:</p>
<ul>
<li><strong>فضای محدود:</strong> برخی موارد ممکن است فضای کافی را برای اجزای اضافی فراهم نکنند یا دسترسی به پین‌های GPIO را دشوار کنند.</li>
<li><strong>سازگاری:</strong> ممکن است همه کیس‌ها با همه مدل‌های Raspberry Pi 4 سازگار نباشند یا فقط با پیکربندی‌های خاصی مطابقت داشته باشند که می‌تواند گزینه‌های کاربر را محدود کند.</li>
<li><strong>به دام انداختن گرما:</strong> برخی موارد ممکن است گرما را به دام بیندازند که می تواند باعث داغ شدن بیش از حد Raspberry Pi 4 یا کاهش سطح عملکرد آن شود.</li>
<li><strong>تهویه محدود:</strong> برخی از موارد ممکن است تهویه کافی را ارائه نکنند و بهینه سازی جریان هوای رزبری پای و جلوگیری از گرمای بیش از حد را دشوار کند.</li>
<li><strong>جداسازی قطعات دشوار است:</strong> جداسازی برخی موارد ممکن است چالش برانگیز باشد و دسترسی به برد Raspberry Pi برای تعمیر و نگهداری یا ارتقاء را دشوار می کند.</li>
<li><strong>هزینه:</strong> برخی از کیس های Raspberry Pi 4 می توانند نسبتاً گران باشند، به خصوص آنهایی که شامل اجزای اضافی مانند فن یا هیت سینک هستند.</li>
</ul>
<p>به طور خلاصه، در حالی که قاب‌های Raspberry Pi 4 محافظت، اتلاف گرما و زیبایی‌شناسی را بهبود می‌بخشند، ممکن است دارای معایبی مانند فضای محدود، سازگاری، جدا کردن قطعات سخت، هزینه، و تهویه محدود یا گیر انداختن گرما باشند. از این رو، کاربران بالقوه باید مواردی را انتخاب کنند که به بهترین وجه با نیازهای آنها مطابقت دارد بر اساس دیدگاه آنها برای جلوگیری از معایب.</p>
',
            'technical_description' => '<p>مشخصات فنی قاب Raspberry Pi 4 بسته به مدل و ساخت کیس می تواند متفاوت باشد. با این حال، در اینجا برخی از مشخصات کلی وجود دارد:</p>
<ul>
<li>جنس: کیس می تواند از پلاستیک، فلز یا مواد دیگری ساخته شود که برد Raspberry Pi را از آسیب فیزیکی محافظت می کند.</li>
<li>اندازه و وزن: اندازه و وزن کیس ممکن است بسته به ابعاد برد Raspberry Pi و متریال مورد استفاده برای کیس متفاوت باشد.</li>
<li>تهویه: برخی از کیس ها ممکن است دارای سیستم های تهویه یا خنک کننده مانند فن ها یا سینک های حرارتی باشند تا از گرمای بیش از حد جلوگیری شود.</li>
<li>پورت ها و کانکتورها: کیس دارای دهانه ها یا بریدگی هایی برای پورت ها، کانکتورها و سایر اجزای مختلف برد Raspberry Pi خواهد بود که امکان دسترسی آسان برای کابل ها و وسایل جانبی را برای اتصال فراهم می کند.</li>
<li>گزینه‌های نصب: برخی از کیس‌ها ممکن است دارای گزینه‌های نصب مانند پیچ، براکت یا نوارهای چسب باشند که نصب برد Raspberry Pi را در یک مکان ثابت آسان‌تر می‌کند.</li>
<li>دسترسی به GPIO: کیس باید دسترسی مستقیم به پین‌های GPIO روی برد Raspberry Pi را فراهم کند و امکان اتصال آسان حسگرها و سایر دستگاه‌ها را فراهم کند.</li>
<li>زیبایی شناسی: برخی از موارد ممکن است در طرح‌ها و رنگ‌های متنوعی باشد که ظاهر آن را بهبود می‌بخشد.</li>
</ul>
<p>در پایان، مشخصات فنی کیس های Raspberry Pi 4 بسته به مدل و ساخت کیس می تواند متفاوت باشد. با این حال، آنها باید تهویه مناسب و دسترسی به پورت ها و کانکتورهای مختلف روی برد Raspberry Pi را فراهم کنند و در عین حال ظاهر آن را بهبود بخشند و برد را از آسیب فیزیکی محافظت کنند.</p>',
        ]);

        ProductImage::create([
            'product_id' => 1,
            'image_path' => 'product_images/jrp14M5j66mhmJ58YG6SfWK0HJRBcdvqEvTi4FUC.jpg',
        ]);

        ProductImage::create([
            'product_id' => 2,
            'image_path' => 'product_images/08V9Ojn2ZCfLvERd992ElyFciMSE3eg9iyly1kMN.jpg',
        ]);

        ProductImage::create([
            'product_id' => 3,
            'image_path' => 'product_images/j1ixo9eShqatFrBFKOkNxeFbloSiemgtW08A7OQL.jpg',
        ]);
    }
}
